---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ScheduleRotationOnSheet
source: html/58fb1883-a3b8-8804-8b65-506f16ef8b04.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ScheduleRotationOnSheet Property

"Rotation on Sheet"

## Syntax (C#)
```csharp
public static ForgeTypeId ScheduleRotationOnSheet { get; }
```